# Q1 Analytics

In [2]:
import pandas as pd
da = pd.read_csv("Analytics.csv")
da.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

In [3]:
da[da.isnull().any(axis=1)]  # no missing data found

Empty DataFrame
Columns: [ts, user_id, country_id, site_id]
Index: []

In [8]:
da[da.country_id == "BDV"].shape

(844, 4)

### 1. site_id with the largest number of unique users

In [9]:
da[da.country_id == "BDV"].groupby('site_id')['user_id'].nunique()

site_id
3POLC      2
5NPAU    544
N0OTG     90
Name: user_id, dtype: int64

### 2. Find four users who visited a certain site more than 10 times

In [42]:
# how many times each users visited each site
df = da[(da.ts > '2019-02-03 00:00:00') & (da.ts < '2019-02-04 23:59:59')][['user_id', 'site_id', 'ts']].groupby(['user_id', 'site_id']).count().reset_index()

In [43]:
df[df.ts > 10]

    user_id site_id  ts
3    LC06C3   N0OTG  25
417  LC3A59   N0OTG  26
485  LC3C7E   3POLC  15
493  LC3C9D   N0OTG  17

### 3. For each site, compute the unique number of users whose last visit was to that site.

In [54]:
# inner join original table with table containing only maximum timestamp for each user
dt = pd.merge(da.groupby(['user_id'])['ts'].agg('max').reset_index(), da, on=['user_id', 'ts'])

In [55]:
dt[dt.user_id=='LC3561'] # check the hint

    user_id                   ts country_id site_id
581  LC3561  2019-02-07 23:44:34        TL6   N0OTG

In [61]:
dt.groupby('site_id')['user_id'].count().reset_index().sort_values(by='user_id', ascending=False)

  site_id  user_id
1   5NPAU      992
5   N0OTG      561
6   QGO3G      289
3   GVOFK       42
0   3POLC       28
7   RT9Z6        2
2   EUZ/Q        1
4   JSUUP        1

### 4. Compute the number of users whose first/last visits are to the same website.

In [74]:
df1 = pd.merge(da.groupby(['user_id'])['ts'].agg('max').reset_index(), da, on=['user_id', 'ts'])
df2 = pd.merge(da.groupby(['user_id'])['ts'].agg('min').reset_index(), da, on=['user_id', 'ts'])

In [78]:
pd.merge(df1, df2, on=['user_id', 'site_id']).shape

(1670, 6)